[
    {"imageName":"Iron man fact 1", "imageDescription":"Ever since the release of the first ‘Iron Man’ film in 2008, the Marvel character has become a certified cultural icon, with his likeness appearing on everything from children’s backpacks to Burger King meals to boxes of frozen pizza. And with the release of ‘Iron Man 3‘ on Friday, Iron Man’s world domination seems almost complete. But despite being around for quite some time, he’s bound to have a few secrets tucked away in his exoskeleton.","url":"http://thumbpress.com/wp-content/uploads/2013/05/Iron-Man-Facts-1.jpg","Reference_web_page":"http://thumbpress.com/iron-man-facts-10-things-you-didnt-know-about-iron-man/"}, 
    {"imageName":"Iron man fact 2", "imageDescription":"Tom Cruise was almost Iron Man. It’s hard to imagine anybody other than Robert Downey, Jr. as Iron Man, but Tom Cruise was considered for the role. He turned it down because he wasn’t pleased with the script. (At one point Quentin Tarantino was interested in directing.) Still, Tom Cruise would’ve made a better Iron Man than Nicolas Cage, who expressed interest in the part as early as 1997. Just think about ‘Ghost Rider’ and pretty much every other Cage role from the past decade for a second, and you’ll see what we mean.","url":"http://thumbpress.com/wp-content/uploads/2013/05/Iron-Man-Facts-2.jpg","Reference_web_page":"http://thumbpress.com/iron-man-facts-10-things-you-didnt-know-about-iron-man/"},
    {"imageName":"Iron man fact 3", "imageDescription":"J.A.R.V.I.S. Has a Lengthy Name. In the Marvel Comics universe, Jarvis is the Avengers’ loyal butler. In the ‘Iron Man’ films, J.A.R.V.I.S. is the name of Stark’s AI system that assists him in superhero-ing. It’s also an acronym that stands for “Just a Rather Very Intelligent System.” Now if only Stark’s robotic lab assistant Butterfingers could just get some respect.","url":"http://thumbpress.com/wp-content/uploads/2013/05/Iron-Man-Facts-3.jpg","Reference_web_page":"http://thumbpress.com/iron-man-facts-10-things-you-didnt-know-about-iron-man/"},
    {"imageName":"Iron man fact 4", "imageDescription":"The Iron Man Suit Can Lift Over 100 Tons. When fully powered, Tony Stark can lift up to 100 tons in the Iron Man suit. Pretty impressive considering that the Hulk’s maximum lift (when calm) is 100 tons as well. Stark would later invent the Hulkbuster armor (seen below) that could lift 175 tons to be able to combat The Hulk in certain situations.","url":"http://thumbpress.com/wp-content/uploads/2013/05/Iron-Man-Facts-4.jpg","Reference_web_page":"http://thumbpress.com/iron-man-facts-10-things-you-didnt-know-about-iron-man/"}
]